# TextNoteOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TextNoteOptions Properties
TextNoteOptions Class See Also
---
The TextNoteOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HorizontalAlignment | Horizontal alignment of the text. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| KeepRotatedTextReadable | Flag controling whether a rotate text is to stay oriented to be always readable. |
| Rotation | Base line angle of a text note, in radians. |
| TypeId | Id of a text type that defines the style of a text note. |
| VerticalAlignment | Vertical alignment of the text. |

# See Also
TextNoteOptions Class
Autodesk.Revit.DB Namespace